# Вопросы для викторины (вариант с множественным выбором и текстовыми ответами)
questions = [
    {
        "question": "Предельные отклонения для фундаментов?",
        "options": ["10мм", "20мм", "12мм"],  # Варианты для вопросов с вариантами
        "answer": "20мм",
        "type": "multiple_choice"
    },
    # {
    #     "question": "Предельные отклонения для тела опор и колон до 5 м?",
    #     "answer": "10мм",  # Текстовый ответ для второго типа вопросов
    #     "type": "text_input"
    # },
    {
        "question": "Предельное смещение осей опалубки от проектного положения для фундаментов мм?",
        "options": ["10мм", "15мм", "12мм"],  # Текстовый ответ для второго типа вопросов
        "answer": "10мм",
        "type": "multiple_choice"
    },
    {
        "question": "Предельное смещение осей опалубки от проектного положения для тела опор и колонн фундаментов под стальные конструкции?",
        "options": ["10мм", "8мм", "12мм"],  # Текстовый ответ для второго типа вопросов
        "answer": "10мм",
        "type": "multiple_choice"
    },
{
        "question": "Отклонение линий плоскостей пересечения от вертикали или проектного наклона на всю высоту конструкций для фундаментов",
        "options": ["10мм", "8мм", "12мм"],  # Текстовый ответ для второго типа вопросов
        "answer": "10мм",
        "type": "multiple_choice"
    },
]
